{
  "id": "cheesequake-hosts-new-training-to-old-bridge",
  "slug": "cheesequake-hosts-new-training-to-old-bridge",
  "title": "Cheesequake hosts new training to Old Bridge",
  "description": "The Cheesequake Fire Company brings to Old Bridge on Nov. 8 the area's first-ever bombings prevention and response training for emergency personnel. ",
  "date": "2025-10-08",
  "author": "Janice Seiferling",
  "category": "business",
  "tags": [
    "business",
    "local",
    "news"
  ],
  "image": "/images/articles/article-page1-1761235711563-4.png",
  "featured": true,
  "content": [
    {
      "type": "paragraph",
      "text": "The Cheesequake Fire Company brings to Old Bridge on Nov. 8 the area's first-ever bombings prevention and response training for emergency personnel. \"Our goal was to put this out for firefighters, but others registered so we opened it up,\" to others both in Old Bridge and the county, according to..."
    },
    {
      "type": "paragraph",
      "text": "The Cheesequake Fire Company brings to Old Bridge on Nov.\n8 the area's first-ever bombings prevention and response training for emergency personnel.\n\"Our goal was to put this out for firefighters, but others registered so we opened it up,\" to others both in Old Bridge and the\ncounty, according to Capt. Joseph Ganci. In addition to firefighters, local and county police departments, emergency medical technicians, Office of Emergency Management employees,\nand more can participate.\nThe course includes how to evaluate and deter threats, shelter-in-place decisions and response priorities in case of a bombing. Lectures, tabletop exercises and videos will be part of the\ntraining, led by instructors from New Mexico Tech Energetic\nMaterials Research & Testing Center (NMT/EMRTC). The center is a member of the National Domestic Preparedness Consortium (NDPC), an alliance sponsored through the U.S. Department of Homeland Security/Federal Emergency Management\nAgency (FEMA) National Preparedness Directorate to provide\ntraining for emergency responders throughout the United States\nand its territories.\nGanci, Firefighter and Trainer Lisa Lent, and others from the\nfire company attended a similar weeklong session for firefighters\nat New Mexico Tech. The training was so informative that the\nCheesequake firefighters decided to arrange for a local, condensed training. \"It's hard for people to get away for a week,\"\nsaid Ganci, so they arranged a daylong training in two parts of\nabout four hours each.\nAt New Mexico Tech, firefighters used virtual reality to walk\nthrough a home and other scenes. \"We ran through scenarios\nabout reducing the threat level\" and handling threats, said\nGanci. \"It was a real look at real target scenarios.\"\nGanci said the training will give insight into incorporating\nawareness and being alert at sites as to potential bomb hazards.\n\"We hope to never use it,\" he said of the training, but there's\nmore to be aware of than most realize.\nLent said that as a trainer, she seeks out ways to make people\nmore knowledgeable as well as to network. \"We have a lot of\namazing volunteers and emergency personnel,\" she said. \"We're\nconstantly looking for ways to educate people, especially for\nfree.\" FEMA fully funds the training both at New Mexico Tech\nand locally, that so far 50 people have registered to attend.\nParticipants must bring a laptop, tablet or smartphone and\nmay attend one or both sessions. The Response to Bomb Incidents session is 8 a.m.-noon and the Prevention of Bomb Incidents session is 1-5 p.m. For additional information, contact\nlisa@cheesequakefire.com or ganci23 @gmail.com."
    }
  ]
}