{
  "id": "local-business-expansion",
  "title": "Local Restaurant Expands to Second Location",
  "excerpt": "Popular family restaurant announces plans to open a second location, bringing more jobs to the community.",
  "date": "2025-08-03",
  "author": "Business Reporter",
  "category": "business",
  "tags": ["business", "economy"],
  "image": "/images/placeholder-council.jpg",
  "featured": false,
  "content": [
    {
      "type": "paragraph",
      "class": "lead",
      "text": "Maria's Family Kitchen, a beloved local restaurant that has served the community for over 15 years, announced plans to open a second location on the east side of town, creating new job opportunities and bringing their famous home-style cooking to more residents."
    },
    {
      "type": "heading",
      "level": 2,
      "text": "Expansion Plans"
    },
    {
      "type": "paragraph",
      "text": "The new location, set to open in early 2026, will be situated in the renovated Eastside Shopping Plaza at 456 Commerce Street. The 3,500 square foot space will feature the same warm, family-friendly atmosphere that has made the original location a community favorite."
    },
    {
      "type": "paragraph",
      "text": "\"We've been overwhelmed by the support from our community over the years,\" said Maria Rodriguez, owner and head chef. \"Opening a second location has been a dream of ours, and we're excited to serve even more families in our growing community.\""
    },
    {
      "type": "heading",
      "level": 2,
      "text": "Job Creation"
    },
    {
      "type": "paragraph",
      "text": "The expansion is expected to create 25-30 new jobs, including positions for:"
    },
    {
      "type": "list",
      "items": [
        "Kitchen staff and line cooks",
        "Servers and host staff",
        "Assistant manager positions",
        "Part-time positions for students"
      ]
    },
    {
      "type": "paragraph",
      "text": "Rodriguez emphasized that they plan to hire locally and provide the same comprehensive training and competitive benefits that current employees enjoy. \"Our staff is like family to us, and we want to extend that same culture to our new location.\""
    },
    {
      "type": "heading",
      "level": 2,
      "text": "Community Impact"
    },
    {
      "type": "paragraph",
      "text": "The restaurant's expansion represents a significant investment in the local economy. Beyond job creation, the new location will:"
    },
    {
      "type": "list",
      "items": [
        "Contribute to the revitalization of the Eastside Shopping Plaza",
        "Provide convenient dining options for east side residents",
        "Support local suppliers and farmers",
        "Generate additional tax revenue for community services"
      ]
    },
    {
      "type": "paragraph",
      "class": "italic",
      "text": "Maria's Family Kitchen is located at 123 Main Street and is open Tuesday through Sunday, 11 AM to 9 PM. For more information about the expansion or employment opportunities, call (555) 987-6543."
    }
  ]
}

