{
  "id": "summer-festival-2025",
  "title": "Annual Summer Festival Returns This Weekend",
  "description": "Join us for three days of family fun, local vendors, live music, and community spirit at Memorial Park.",
  "date": "2025-08-05",
  "author": "Events Team",
  "category": "community",
  "tags": ["festival", "family", "entertainment"],
  "image": "/images/placeholder-parade.jpg",
  "featured": true,
  "content": [
    {
      "type": "paragraph",
      "class": "lead",
      "text": "After a successful run last year, the Annual Summer Festival is back and bigger than ever. This weekend, Memorial Park will transform into a vibrant celebration of community spirit, featuring three full days of entertainment, local vendors, and family-friendly activities."
    },
    {
      "type": "heading",
      "level": 2,
      "text": "What to Expect"
    },
    {
      "type": "paragraph",
      "text": "The festival kicks off Friday evening at 5 PM with the opening ceremony and continues through Sunday evening. Visitors can expect:"
    },
    {
      "type": "list",
      "items": [
        "<strong>Live Music:</strong> Local bands and performers will take the main stage throughout the weekend",
        "<strong>Food Vendors:</strong> Over 20 local restaurants and food trucks offering diverse cuisines",
        "<strong>Arts & Crafts:</strong> Local artisans showcasing handmade goods and offering workshops",
        "<strong>Kids Zone:</strong> Dedicated area with games, face painting, and activities for children",
        "<strong>Community Booths:</strong> Local organizations and businesses sharing information and services"
      ]
    },
    {
      "type": "heading",
      "level": 2,
      "text": "Schedule Highlights"
    },
    {
      "type": "heading",
      "level": 3,
      "text": "Friday, August 8th"
    },
    {
      "type": "list",
      "items": [
        "5:00 PM - Opening Ceremony",
        "6:00 PM - Local High School Band Performance",
        "8:00 PM - Community Choir Concert"
      ]
    },
    {
      "type": "heading",
      "level": 3,
      "text": "Saturday, August 9th"
    },
    {
      "type": "list",
      "items": [
        "10:00 AM - Kids Fun Run",
        "12:00 PM - Cooking Demonstration by Chef Maria's Restaurant",
        "2:00 PM - Local History Walking Tour",
        "7:00 PM - Main Stage Concert featuring The River Valley Band"
      ]
    },
    {
      "type": "heading",
      "level": 3,
      "text": "Sunday, August 10th"
    },
    {
      "type": "list",
      "items": [
        "11:00 AM - Community Service Awards Ceremony",
        "1:00 PM - Pet Parade and Contest",
        "3:00 PM - Local Business Showcase",
        "6:00 PM - Closing Ceremony and Fireworks"
      ]
    },
    {
      "type": "heading",
      "level": 2,
      "text": "Getting There"
    },
    {
      "type": "paragraph",
      "text": "Memorial Park is located at 123 Park Avenue, with ample parking available in the adjacent municipal lot. For those using public transportation, the #15 bus stops directly at the park entrance. We encourage carpooling and using alternative transportation when possible."
    },
    {
      "type": "heading",
      "level": 2,
      "text": "Volunteer Opportunities"
    },
    {
      "type": "paragraph",
      "text": "The festival is made possible by dedicated community volunteers. If you're interested in helping out, there are still opportunities available for setup, cleanup, and event assistance. Contact the Parks and Recreation Department at (555) 123-4567 to get involved."
    },
    {
      "type": "paragraph",
      "class": "italic",
      "text": "The Annual Summer Festival is free to attend and open to all community members. For more information, visit the Parks and Recreation website or call (555) 123-4567."
    }
  ]
}

